Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.Attributes Property
 The common attributes of all reinforcements. For more information see ReinforcementBase.ReinforcementBaseAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.ReinforcementBaseAttributes Attributes { get; set; }
Public Property Attributes As ReinforcementBase.ReinforcementBaseAttributes
	Get
	Set
Property Value
Type: ReinforcementBase.ReinforcementBaseAttributes
See Also
Reference
ReinforcementBase Class
Tekla.Structures.Drawing Namespace